<?php

// Heading
$_['heading_title'] = '<img width="24" height="24" src="view/image/neoseo.png" style="float: left;"><span style="margin:0;line-height: 24px;">NeoSeo Обмен с Bitrix24</span>';
$_['heading_title_raw'] = 'NeoSeo Обмен с Bitrix24';

//Tabs
$_['tab_general'] = 'Основные настройки';
$_['tab_logs'] = 'Логи';
$_['tab_support'] = 'Поддержка';
$_['tab_license'] = 'Лицензия';
$_['tab_lead'] = 'Лиды';
$_['tab_deal'] = 'Сделки';
$_['tab_contact'] = 'Контакты';
$_['tab_usefull'] = 'Полезные ссылки';

// Text
$_['text_module_version'] = '';
$_['text_success'] = 'Настройки модуля обновлены!';
$_['text_module'] = 'Модули';
$_['text_success_clear'] = 'Лог файл успешно очищен!';
$_['text_clear_log'] = 'Очистить лог';
$_['text_clear'] = 'Очистить';
$_['text_match_table_contact_type'] = 'Таблица соответствий: Группа покупателя на сайте - Тип контакта в Bitrix24';
$_['text_match_table_deal_stage'] = 'Таблица соответствий: Статус заказа на сайте - Стадия сделки в Bitrix24';
$_['text_match_table_deal_type'] = 'Таблица соответствий: Категория на сайте - Тип сделки в Bitrix24';
$_['text_both'] = 'Телефон и email';
$_['text_email'] = 'По email';
$_['text_telephone'] = 'По телефону';

//Columns
$_['column_customer_group'] = 'Группа покупателя';
$_['column_type_contact'] = 'Тип контакта';
$_['column_order_status'] = 'Статус заказа';
$_['column_deal_stage'] = 'Стадия сделки';
$_['column_category'] = 'Категория';
$_['column_deal_type'] = 'Тип сделки';

//Buttons
$_['button_save'] = 'Сохранить';
$_['button_save_and_close'] = 'Сохранить и Закрыть';
$_['button_close'] = 'Закрыть';
$_['button_recheck'] = 'Проверить еще раз';
$_['button_clear_log'] = 'Очистить лог';
$_['button_download_log'] = 'Скачать файл логов';

// Entry
$_['entry_debug'] = 'Отладочный режим:<br /><span class="help">В логи модуля будет писаться различная информация для разработчика модуля.</span>';
$_['entry_status'] = 'Статус';
$_['entry_instruction'] = 'Инструкция к модулю:';
$_['entry_history'] = 'История изменений:';
$_['entry_faq'] = 'Часто задаваемые вопросы:';
$_['entry_portal_name'] = 'Название портала';
$_['entry_portal_name_desc'] = 'Название портала можно получить через ссылку в создании вебхука. Указывается лишь название портала, без bitrix24. Например, название портала test.bitrix24. В поле необходимо указать <b>test</b>';
$_['entry_id_user'] = 'Идентификатор пользователя';
$_['entry_id_user_desc'] = 'Числовой идентификатор пользователя, создавшего вебхук. Под правами этого пользователя будет работать этот вебхук. ИД можно получить через ссылку в создании вебхука';
$_['entry_secret_code'] = 'Секретный код';
$_['entry_secret_code_desc'] = 'Секретный код, можно получить через ссылку в создании вебхука';
$_['entry_domain'] = 'Домен для синхронизации';

$_['entry_lead_user_id'] = 'Пользователь, который ответственный за лиды';

$_['entry_add_lead_register'] = 'Создавать лид при регистрации';
$_['entry_add_lead_register_desc'] = 'Лид будет создан только при использовании стандартных методов регистрации';
$_['entry_add_lead_neoseo_catch_contacts'] = 'Создавать лид при создании заявки в модуле "NeoSeo Захват контактов"';
$_['entry_add_lead_neoseo_catch_contacts_desc'] = 'Лид будет создан только при наличии установленного модуля "NeoSeo Захват контактов"';
$_['entry_add_lead_neoseo_notify_when_available'] = 'Создавать лид при создании заявки в модуле "NeoSeo Подписка на поступление товара"';
$_['entry_add_lead_neoseo_notify_when_available_desc'] = 'Лид будет создан только при наличии установленного модуля "NeoSeo Подписка на поступление товара"';

$_['entry_source_lead_register'] = 'Источник при  регистрации';
$_['entry_source_lead_neoseo_account_register'] = 'Источник при регистрации в модуле "NeoSeo Личный кабинет покупателя"';
$_['entry_source_lead_neoseo_checkout_register'] = 'Источник при регистрации в модуле "NeoSeo Оформление заказа"';
$_['entry_source_lead_neoseo_catch_contacts'] = 'Источник при создании заявки в модуле "NeoSeo Захват контактов"';
$_['entry_source_lead_neoseo_notify_when_available'] = 'Источник при создании заявки в модуле "NeoSeo Подписка на поступление товара"';

$_['entry_add_deal_order'] = 'Создавать сделку при создании заказа';
$_['entry_add_deal_order_desc'] = 'Сделка будет создана при использовании стандартных методов создания заказа';
$_['entry_deal_user_id'] = 'Пользователь, который ответственный за сделки';
$_['entry_deal_stage_default'] = 'Стадия сделки по умолчанию';
$_['entry_deal_stage_default_desc'] = 'Применяется, если статус заказа не выбран в таблице соответствий.';
$_['entry_deal_type_default'] = 'Тип сделки по умолчанию';
$_['entry_deal_type_default_desc'] = 'Применяется, если категория не выбрана в таблице соответствий.';
$_['entry_deal_extra_property'] = 'Выгружать расширенные данные по сделке';
$_['entry_unload_options'] = 'Выгружать опции в комментарии к сделке';
$_['entry_unload_order_status'] = 'Создавать сделку, если заказу присвоен статус';

$_['entry_add_contact'] = 'Создавать контакт перед созданием лида';
$_['entry_contact_user_id'] = 'Пользователь, который ответственный за контакты';
$_['entry_source_contact'] = 'Источник при создании контакта';
$_['entry_type_contact_default'] = 'Тип контакта по умолчанию';
$_['entry_type_contact_default_desc'] = 'Применяется, если группа покупателя не выбрана в таблице соответствий.';
$_['entry_one_deal'] = 'Весь заказ отдавать одной сделкой';
$_['entry_one_deal_desc'] = 'Передавать все товары заказа и данные о заказе одной сделкой';
$_['entry_product_model_name'] = 'Добавить модель к названию товара';
$_['entry_not_add_new_contact'] = 'Если не найден контакт в битрикс - добавить лид без контакта';
$_['entry_custom_field_phone'] = 'Укжите название доп. поля для заказа где используется телефон';
$_['entry_custom_field_phone_desc'] = 'Если в заказе нет основного телефона, модуль заберет из дополнительного поля заказа телефон';
$_['entry_search_contact_by'] = 'По какому методу искать контакты в Битрикс24';

$_['entry_deal_extra_property_desc'] = '<b>Варианты настройки опции "выгружать расширенные данные по сделке":</b>
<ol>
    <li>Если в сделке Вам нужно выгружать дополнительные данные по заказу, укажите <b>Название;Таблица БД;Поле</b>, где
        <ul>
            <li>
                <b>Название</b> - название идентификатора поля в Битрикс24, в который будет помещены дополнительные данные, 
            </li>
            <li>
                <b>Таблица БД</b> - таблица из которой будет взято дополнительные данные,
            </li>
            <li>
                <b>Поле</b> - поле таблицы, из которого будет взято значение и помещено в дополнительное поле. 
            </li>
        </ul>
    </li>
    <b>Пример:</b> UF_CRM_5EB107860C481;oc_order;shipping_address_1 <br>
    <b>ВАЖНО!</b> Обязательное наличие в таблице одного из полей order_id или customer_id.<br> 
<br>
	<li>Если в сделке Вам нужно выгружать дополнительные данные по заказу с доп. проверкой, укажите <br><b>Название;Таблица БД;Поле по которому искать=Его значение=Поле которое надо получить</b>,<br> где
        <ul>
            <li>
                <b>Название</b> - название идентификатора поля в Битрикс24, в который будет помещены дополнительные данные, 
            </li>
            <li>
                <b>Таблица БД</b> - таблица из которой будет взято дополнительные данные,
            </li>
            <li>
                <b>Поле по которому искать</b> - поле таблицы, по которому необходимо выполнять дополнительный поиск.
            </li>
            <li>
                <b>Его значение</b> - Это значение которое должно присутствовать в предыдущем поле и по нему проводить поиск
            </li>
            <li>
                <b>Поле которое надо получить</b> - поле таблицы, из которого будет взято значение и помещено в дополнительное поле. 
            </li>
        </ul>
    </li>
    <b>Пример:</b> UF_CRM_5EB107860C481;oc_order;shipping_address_1 <br>
    <b>ВАЖНО!</b> Обязательное наличие в таблице одного из полей order_id или customer_id.<br> 
<br>
    <li>Если в сделке Вам нужно выгружать дополнительные поля по заказу (раздел "Настраиваемые поля"), укажите <b>Название;[Поле]</b>, где
        <ul>
            <li>
                <b>Название</b> - название идентификатора поля в Битрикс24, в который будет помещены данные из дополнительных полей заказа, 
            </li>
            <li>
                <b>Поле</b> - название настраиваемого поля в системе Opencart.
            </li>
        </ul>
    </li>
    <b>Пример:</b> UF_CRM_5EB107861638B;[Улица] <br>
<br>
    <li>
Если в сделке Вам нужно выгрузить ссылку на заказ, укажите  <b>Название;{order_link}</b>, где
        <ul>
            <li>
                <b>Название</b> - название идентификатора поля в Битрикс24, в которое будет помещена ссылка на заказ, 
            </li>
            <li>
                <b>{order_link}</b> - шаблон
            </li>
        </ul>
    </li>
    <b>Пример:</b> UF_CRM_5EB3E1B87E310:{order_link} <br>
</ol>
    <b>ВАЖНО!</b> Разбор указанных полей должен быть настроен в Битрикс 24. Каждая запись с новой строки. <br> ';

// Error
$_['error_permission'] = 'У Вас нет прав для управления этим модулем!';
$_['error_empty_params'] = 'Для отображения списка выбора пользователей и источников (вкладка Контакты, Лиды и Сделки) необходимо заполнить основные параметры модуля и сохранить настройки!';
$_['error_download_logs'] = 'Файл логов пустой или отсутствует!';
$_['error_status_disabled'] = 'Для отображения содержимого вкладок необходимо активировать лицензию и включить модуль!';
$_['error_ioncube_missing'] = '';
$_['error_license_missing'] = '';
$_['mail_support'] = '';
$_['module_licence'] = '';

//links
$_['instruction_link'] = '<a target="_blank" href="https://neoseo.com.ua/index.php?route=blog/soforp_article&article_id=470">https://neoseo.com.ua/nastroyka-modulya-obmen-s-bitrix24-opencart</a>';
$_['history_link'] = '<a target="_blank" href="https://neoseo.com.ua/index.php?route=product/product&product_id=312#faqBox">https://neoseo.com.ua/obmen-s-bitrix24-opencart-v-3-0</a>';
$_['faq_link'] = '<a target="_blank" href="https://neoseo.com.ua/index.php?route=product/product&product_id=312#module_history">https://neoseo.com.ua/obmen-s-bitrix24-opencart-v-3-0</a>';
